from typing import List

if __name__ == '__main__':
    print('Необходимо вывести на экран список простых чисел от 0 до 1000. \nРеализуйте это двумя способами: ')
    print('1. «однострочным» кодом, без объявления дополнительных функций;')
    print('1 способ: ', [x for x in range(1000)])
    print('2 способ: ', list(range(1000)))

    print('1. обычным, «своим» кодом, который покажется вам наиболее красивым')
    numbers: List[int] = []
    for i in range(1000):
        numbers.append(i)
    print('3 способ: ', numbers)

    print('Мне удобен 1 способ')